Revit 2026 API

# PolyLineGetTransformed Method

---

Gets the copy of the polyline which is applied the specified transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PolyLine GetTransformed(
	Transform transform
)
```
```vb
Public Function GetTransformed (
	transform As Transform
) As PolyLine
```
```cpp
public:
PolyLine^ GetTransformed(
	Transform^ transform
)
```
```fsharp
member GetTransformed :
        transform : Transform -> PolyLine
```

#### Parameters

transform Transform

#### Return Value

PolyLine

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the transform is . |

#### Reference

PolyLine Class

Autodesk.Revit.DB Namespace